[
  {
    "name": "JPAD Modeller presentation",
    "tags": "aircraft design, JPAD Modeller, knowledge-based aircraft modelling",
    "type": "Real World Application",
    "domain": "Aviation",
    "minutes": "6",
    "platform": "Desktop",
    "description": "A 5 mins demo presentation of JPAD Modeller, exploring the UI and the user experience.",
    "id": "La-xGA2bw1o",
    "event": "",
    "createdOn": "2021-11-02",
    "modifiedOn": "2021-11-02",
    "publishedOn": "2021-10-15",
    "personIds": [
      "a.demarco"
    ]
  },
  {
    "name": "Introducing JPAD Modeller",
    "tags": "aircraft design, JPAD Modeller, knowledge-based aircraft modelling",
    "type": "Real World Application",
    "domain": "Aviation",
    "minutes": "1",
    "platform": "Desktop",
    "description": "Introducing JPAD Modeller, an efficient pre-processor for several third-party tools typically used in aircraft conceptual and preliminary design studies.",
    "id": "-xbaVCw7fAY",
    "event": "",
    "createdOn": "2021-11-02",
    "modifiedOn": "2021-11-02",
    "publishedOn": "2021-10-15",
    "personIds": [
      "a.demarco"
    ]
  },
  {
    "name": "Modellus + FXRibbon + JMetro (interview with Pedro Duque Vieira on Almas channel)",
    "tags": "modelling, mathematics, university, teaching, academic, Library",
    "type": "Interview",
    "domain": "Education",
    "minutes" : "48",
    "platform": "Desktop",
    "description": "Interview on Almas channel with Pedro Duque Vieira. Talking about Modellus a free JavaFX application used worldwide, mostly on Universities and High Schools.\n\n On this talk Pedro also talks about FXRibbon, a Microsoft Ribbon like control for Javafx. And JMetro, a modern JavaFX theme.",
    "id": "SVek-DzR5B8",
    "event": "",
    "createdOn": "2021-07-25",
    "modifiedOn": "2021-07-25",
    "publishedOn": "2021-01-15",
    "personIds": [
      "p.vieira"
    ]
  },
  {
    "name": "Java Desktop 2020 - Keynote at JFX Days 2020 | Hendrik Ebbers",
    "tags": "",
    "type": "Presentation",
    "description": "Follow Java Champion Hendrik Ebbers on his story of \"Little Duke's Journey to the Moon\". During this keynote presentation held at JFX Days 2020 on Nov 24, 2020, Hendrik investigates what is wrong with Java in regards of the development of desktop applications. Is this a problem of Java - although it is still one of the most used programming languages? Or is it a problem of Java Desktop respectively JavaFX? Or maybe the problem is the community or - even worse - Oracle itself. \n\nIn this entertaining talk, Hendrik points out that there is no problem with all of the above. Developers need to accept that Java Desktop is a niche. But all together, the community can make this niche shine.",
    "id": "mIR2TucAwSQ",
    "minutes" : "27",
    "event": "JFX Days 2020",
    "platform": "Desktop, Web, Mobile, Embedded",
    "createdOn": "2021-05-18",
    "modifiedOn": "2021-05-28",
    "publishedOn": "2020-12-08",
    "personIds": [
      "h.ebbers"
    ]
  },
  {
    "name": "JavaFX Roadmap @ JFX Days 2020 | Wolfgang Weigend",
    "tags": "",
    "type": "Presentation",
    "description": "Wolfgang Weigend works as Master Principal Solution Engineer at Oracle Global Services Germany GmbH in the worldwide Java team. He is involved in Java technology, GraalVM and architecture to develop enterprise Java applications. During his talk at the JFX Days 2020 on Nov 24, he presented the JavaFX roadmap and covers topics like OpenJFX, GraalVM and NVIDIA's GPU.\n\nSoftware solution engineer at Oracle about Java technology, GraalVM & architecture to develop enterprise Java applications",
    "id": "PEl7Ojla9bc",
    "minutes" : "22",
    "event": "JFX Days 2020",
    "platform": "Desktop, Web, Mobile, Embedded",
    "createdOn": "2021-05-18",
    "modifiedOn": "2021-05-28",
    "publishedOn": "2020-12-08",
    "personIds": [
      "w.weigend"
    ]
  },
  {
    "name": "Moving JavaFX forward - Keynote Day 2 @ JFX Days 2020 | Johan Vos",
    "tags": "",
    "type": "Presentation",
    "description": "Gluon has been the defacto JavaFX steward since the JavaFX 11 release. Gluon builds and maintains the JavaFX artifacts and makes them available as SDK's as well as on Maven Central. Moving JavaFX forward is often a balance between adding new features and staying at the front of the UI development, while also making sure that the core principles of Java, especially backward compatibility, are respected.\n​\nIn the past year, focus was mainly on the transition to making JavaFX a set of modules that work well with evolving JDK releases as well as integrate with standard build, deploy and devops tools that are popular in the development community. One of the main focusses of JavaFX is to make sure it works on as much platforms as possible: desktop, but also mobile and embedded. In this session, Johan Vos, CEO of Gluon, presented some of the future ideas.",
    "minutes" : "50",
    "id": "Q9ueZa_YkJg",
    "event": "JFX Days 2020",
    "platform": "Desktop, Web, Mobile, Embedded",
    "createdOn": "2021-05-18",
    "modifiedOn": "2021-05-28",
    "publishedOn": "2020-12-14",
    "personIds": [
      "j.vos"
    ]
  },
  {
    "name": "Building Modular JavaFX Applications with JPMS and Layrry | Andres Almiray @ JFX Days 2020",
    "tags": "module system",
    "type": "Library",
    "description": "The Java Module System lays the foundation for building modularized applications on the JVM. It doesn't concern itself though with resolving module versions and obtaining modules from repositories. This is where Layrry comes in: an API and launcher for modularized Java applications which takes a descriptor of the module layer(s) to assemble, fetches the modules and starts up the application. Layrry also allows dynamic loading.unloading of plugins which makes it ideal for JavaFX applications, allowing app developers to provide behavior on the fly.\n\nPresented by Andres Almiray at JFX Days 2020.",
    "id": "dsUFuIuDqeo",
    "minutes" : "27",
    "event": "JFX Days 2020",
    "platform": "Desktop, Web, Mobile, Embedded",
    "createdOn": "2021-05-18",
    "modifiedOn": "2021-05-28",
    "publishedOn": "2020-12-14",
    "personIds": [
      "a.almiray"
    ]
  },
  {
    "name": "JavaFX Game Development: Enter FXGL Engine | Almas Baimagambetov @ JFX Days 2020",
    "tags": "gaming",
    "type": "Library",
    "domain": "Gaming",
    "description": "Modern JavaFX provides hardware acceleration support on a range of platforms, including desktop, mobile and embedded, allowing the development of high-performance cross-platform applications. However, to develop games with JavaFX effectively, numerous domain-specific concepts are needed. \n\nTo address this need, the FXGL game engine extends JavaFX and brings support for real-world game development techniques. These include the entity-component model, A* pathfinding, particle systems, sprite sheet animations and many other features. As a result, JavaFX developers can produce games more quickly and more effectively with FXGL. \n\nIntegrating seamlessly with Gluon's Client plugin, FXGL users can easily package their games to native platform images, including Android and iOS. By the end of this session, attendees will be able to: \n\n- Describe and explain basic FXGL features. \n- Produce a simple game with FXGL.\n\nThis session of Almas Baimagambetov was recorded on Nov 24, 2020 during the JFX-Days 2020.",
    "id": "n-6t2-a-D_c",
    "minutes" : "52",
    "platform": "Desktop, Web, Mobile, Embedded",
    "event": "JFX Days 2020",
    "createdOn": "2021-05-18",
    "modifiedOn": "2021-05-28",
    "publishedOn": "2020-12-21",
    "personIds": [
      "a.baimagambetov"
    ]
  },
  {
    "name": "JPro in Practise | Florian Kirmaier @ JFX Days 2020",
    "tags": "browser, web, html, js",
    "type": "Library",
    "platform": "Web",
    "description": "In this talk, we will concentrate on three aspects:\n\n(1) We will go through a short and concise hands on tutorial to show how easy it can be to take a running Java application and bring it to the web.  \n\n(2) we will demonstrate some of our running and exciting projects, to show what is doable and what not.  \n\nAnd (3) the session will address a set of recurring Q&A’s experienced from the market, as well as giving room for ad hoc questions from the audience.\n\nThis presentation by Florian Kirmaier has been recorded on Nov 24 during the JFX Days 2020.",
    "id": "_Cf4djWcpxA",
    "minutes" : "12",
    "event": "JFX Days 2020",
    "createdOn": "2021-05-18",
    "modifiedOn": "2021-05-28",
    "publishedOn": "2020-12-21",
    "personIds": [
      "f.kirmaier"
    ]
  },
  {
    "name": "JavaFX Touch @ Industrie | Michael Hoffer @ JFX Days 2020",
    "tags": "",
    "type": "Real World Application",
    "domain": "Manufacturing, Research",
    "description": "Creating reliable and modern Desktop applications is one of the key strengths of JavaFX. Yes, desktop applications are still relevant. \n\nAt BioFluidiX, we use JavaFX for creating intuitive touch-based user interfaces for controlling our liquid handling robots and other devices. The JavaFX scene graph is ideal for the interactive visualization of robotic actuators and sensors. Java is well equipped for communicating with industrial hardware and the property API is convenient for processing real-time data. \n\nIn this presentation, Michael Hoffer showed real-world applications as well as a user interface for the Arduino-based DIY project \"ZEN-table\", a sand table that draws beautiful sand patterns. ",
    "id": "YMxF-8XB5GU",
    "minutes" : "45",
    "event": "JFX Days 2020",
    "platform": "Desktop",
    "createdOn": "2021-05-18",
    "modifiedOn": "2021-05-28",
    "publishedOn": "2020-12-28",
    "personIds": [
      "m.hoffer"
    ]
  },
  {
    "name": "JavaFX real-world application: Senapt CRM | Dirk Lemmermann @ JFX Days 2020",
    "tags": "energy, crm, UK, dcc, heating, climate",
    "type": "Real World Application",
    "domain": "Energy",
    "platform": "Desktop, Web",
    "description": "Designed and developed with a legacy of energy industry experience, SenaptCRM is optimised to run only on the infrastructure it needs and no more, maintaining a responsive and stable user experience. \n\nWith a zero upfront costs for energy suppliers, yet sufficiently scalable to satisfy the demands of the changing energy landscape - Senapt EaaS innovative, cloud -native platform and consumption based pricing model delivers a win for all.\n\nDirk Lemmermann, Technical Director at Senapt Ltd., presented this JavaFX-based CRM at the JFX Days 2020.",
    "id": "ZjIMnAaDmM8",
    "minutes" : "18",
    "event": "JFX Days 2020",
    "createdOn": "2021-05-18",
    "modifiedOn": "2021-05-28",
    "publishedOn": "2020-12-28",
    "personIds": [
      "d.lemmermann"
    ]
  },
  {
    "name": "Using JavaFX to Combat Illegal Dynamite Fishing in Tanzania | Jamie Macaulay @ JFX Days 2020",
    "tags": "research, science, wildlife, academic, sensors",
    "type": "Real World Application",
    "description": "Since the 1960s, indiscriminate fishing techniques using underwater explosives have been widespread across the coastal zone of Tanzania, Africa. So-called \"bomb fishing\" causes untold damage to the structures (e.g. coral reefs) and soundscapes of marine habitats and the animals within. At its recorded peak in 2016, tens of thousands of bomb blasts were visually recorded along the Tanzanian coastline, with many more likely undetected and unreported, representing a substantial and endemic conservation problem.\n \nGathering data on the location, timing and number of explosions over time is essential for understanding exactly when and where blasting occurs, for alerting enforcement in a timely manner, and for monitoring the effectiveness of any interventions. Listening for bomb blasts underwater (passive acoustic monitoring) has the great advantage over visual observation in that blasts can be detected during both the day and night, and this can be done over thousands of square kilometres.\n \nHowever, such acoustic monitoring schemes generate vast quantities of data which must be automatically analysed. Typically, a machine learning based approach would be used to build an accurate acoustic classifier, however, the combination of little training data on fish bomb blasts and the poorly documented soundscape of Tanzanian reefs mean that building an accurate automated classifier is difficult. Here we instead adopted a hybrid analysis approach, where we ran an automated detector that extracted any sound of interest, and then used JavaFX to build a highly interactive visualisation of the data. This enabled a manual analyst to quickly identify fish bomb blasts, allowing for months of raw data to be sifted through with the times and audio clips of fish bomb blasts extracted in a few hours, compared to the weeks of time it would have taken otherwise.\n \nJavaFX provided the means to build fast and intuitive data visualisation tools, an easy-to-use and attractive GUI, and critically, allowed this to be achieved on modest financial and time budgets. JavaFX enabled real-time conservation in the marine environments, and was key to the success of this (and other) wildlife conservation projects.",
    "id": "b9H6kmEy90c",
    "minutes" : "23",
    "event": "JFX Days 2020",
    "platform": "Desktop",
    "createdOn": "2021-05-18",
    "modifiedOn": "2021-05-28",
    "publishedOn": "2021-01-04",
    "personIds": [
      "j.macaulay"
    ]
  },
  {
    "name": "JavaFX real-world application: A JavaFX CAD Software | Pedro Duque Vieira @ JFX Days 2020",
    "tags": "",
    "type": "Real World Application",
    "platform": "Desktop",
    "domain": "CAD, Energy",
    "description": "This talk is about a recently shipped and currently in use CAD application that Pedro Duque Vieira has finished developing for a client, using JavaFX. It can be seen as an application similar to Autocad (which is used in Civil Engineering, Architecture, etc) but with the specific purpose to do energy efficiency assessment. \n\nIt is an excellent example on the benefit of using JavaFX to develop these kinds of applications. This software was finished in a much smaller time frame and a much smaller budget than other similar projects from competing companies. The users’ feedback to its release has gone way beyond what was expected.",
    "id": "8jkKF5LgonQ",
    "minutes" : "18",
    "event": "JFX Days 2020",
    "createdOn": "2021-05-18",
    "modifiedOn": "2021-05-28",
    "publishedOn": "2021-01-04",
    "personIds": [
      "p.vieira"
    ]
  },
  {
    "name": "JavaFX Performance | Anton Epple @ JFX Days 2020",
    "tags": "tips, tricks",
    "type": "Presentation",
    "description": "JavaFX is a great framework for creating graphically rich and highly interactive applications. The Scene Graph API makes it really easy to visualize your data with  rich controls, complex animations and CSS styling. When done right, JavaFX applications can be blazingly fast. But while the high level API protects you from having to write lots of graphics code, it also makes finding performance problems hard. In this session recorded at JFX Days 2020, Anton Epple presented tools and strategies for identifying and solving JavaFX performance issues.",
    "id": "m6WIQhH4dZg",
    "minutes" : "54",
    "platform": "Desktop, Web, Mobile, Embedded",
    "event": "JFX Days 2020",
    "createdOn": "2021-05-18",
    "modifiedOn": "2021-05-28",
    "publishedOn": "2021-01-11",
    "personIds": [
      "a.epple"
    ]
  },
  {
    "name": "Chart-FX - Why and How to Plot 1001k scientific data points @ 25 Hz | A. Krimm & R. Steinhagen",
    "tags": "charts, graphs, research, science",
    "type": "Library",
    "domain": "Charts",
    "description": "Chart-FX is a scientific charting library focused on performance optimized real-time data visualization at 25 Hz update rates for data sets with a few 10 thousand up to 5 million data points. From its origin, design choices, functional highlights to its real-world high-performance use-cases, and its future, this contribution presents some of the challenges, encountered opportunities as well as benefits since open-sourcing this library.",
    "id": "NK4pgRF9XWk",
    "minutes" : "18",
    "event": "JFX Days 2020",
    "platform": "Desktop, Web, Mobile, Embedded",
    "createdOn": "2021-05-18",
    "modifiedOn": "2021-05-28",
    "publishedOn": "2021-01-11",
    "personIds": [
      ""
    ]
  },
  {
    "name": "GemsFX | Dirk Lemmermann @ JFX Days 2020",
    "tags": "custom controls",
    "type": "Library",
    "domain": "",
    "description": "GemsFX is a collection of JavaFX controls and utilities. Dirk Lemmermann presented the date and time pickers, the PDF view control and many more during his session at JFX Days 2020.",
    "id": "jmKYWdNbty0",
    "minutes" : "15",
    "event": "JFX Days 2020",
    "platform": "Desktop, Web, Mobile, Embedded",
    "createdOn": "2021-05-18",
    "modifiedOn": "2021-05-28",
    "publishedOn": "2021-01-18",
    "personIds": [
      "d.lemmermann"
    ]
  },
  {
    "name": "Having Fun with Java and JavaFX on the Raspberry Pi | Frank Delporte @ JFX Days 2020",
    "tags": "raspberry pi, pi, embedded, kiosk",
    "type": "Library",
    "platform": "Embedded",
    "description": "Java, JavaFX and a Raspberry Pi are an ideal combination for any project where you want to connect software and hardware (LEDs, buttons, sensors...) with a beautiful, easy-to-use user interface. In this talk, we will go through the process of building a JavaFX touchscreen user interface to control a relay board and an Arduino with LED strips that were needed to solve the problem of getting my son to the dinner table while he is playing the drums...\n \nThis includes selecting a Java JDK for Raspberry Pi, setting up a Mosquitto queue, programming the Arduino, understanding the GPIO's on the Raspberry Pi, including a web server, and a lot more. We will also have guest appearances of Spring, Undertow, MQTT, OpenWeatherAPI, Pi4J, BellSoft, Gluon, I²C, SPI...\n \nHardware experiments may seem challenging but with some basic knowledge and cheap components, you'll discover it’s a great way to learn a lot of new stuff!",
    "id": "Thzh7bislEg",
    "minutes" : "50",
    "event": "JFX Days 2020",
    "createdOn": "2021-05-18",
    "modifiedOn": "2021-05-28",
    "publishedOn": "2021-01-18",
    "personIds": [
      "f.delporte"
    ]
  },
  {
    "name": "Shipping JavaFX | Joel Ferreira @ JFX Days 2020",
    "tags": "",
    "type": "Real World Application",
    "domain": "Logistics",
    "platform": "Desktop",
    "description": "Together with Contship Italia Group, we developed two editors that simplify and optimize their workflows. While the Vessel Editor may be used to visualize and manage bays (container block in the transverse direction) of container ships, the Yard Editor is the ideal tool for visualizing port facilities and for optimizing local processes.",
    "id": "tW59mzR6vTc",
    "event": "JFX Days 2020",
    "minutes" : "16",
    "createdOn": "2021-05-18",
    "modifiedOn": "2021-05-28",
    "publishedOn": "2021-01-25",
    "personIds": [
      ""
    ]
  },
  {
    "name": "From Forms to OpenGL | Tom Schindl @ JFX Days 2020",
    "tags": "",
    "type": "Presentation",
    "description": "Most developers associate integrating OpenGL into JavaFX as a high profile task. For them it might come as a surprise that implementing \"boring\" business UIs that look slick, that are accessible, and that are well architectured, is just as much of a high profile task.\n \nIn this talk we will show real world use cases and highlight how we implemented high quality form-based UIs leveraging JavaFX and code generators. We will talk about \"accessibility\" (a11y) and the roadblocks we hit.\n​\nLast but not least we will talk a bit about DriftFX providing an update on the current status and what comes next.",
    "id": "NusKg2ZWnrg",
    "minutes" : "52",
    "event": "JFX Days 2020",
    "platform": "Desktop",
    "createdOn": "2021-05-18",
    "modifiedOn": "2021-05-28",
    "publishedOn": "2021-02-01",
    "personIds": [
      "t.schindl"
    ]
  },
  {
    "name": "ValidatorFX | Robert Lichtenberger @ JFX Days 2020",
    "tags": "",
    "type": "Library",
    "description": "ValidatorFX is a validation library for JavaFX. It is inspired by ControlsFX but tries to overcome its shortcomings:\n\n- Validations based on arbitrary observable values (not just the value of a control)\n- Validations can decorate an arbitrary number of nodes (not just the one control)\n- Validations can decorate any node (not just Control subtypes)\n- Validations can be done immediately or on-demand (e.g. when clicking a button)\n\nThe central class of ValidatorFX is Validator which contains a number of Checks. As a rule a form will have one Validator object and multiple Checks.",
    "id": "dSYsuPuYaZ8",
    "minutes" : "18",
    "event": "JFX Days 2020",
    "platform": "Desktop, Web, Mobile, Embedded",
    "createdOn": "2021-05-18",
    "modifiedOn": "2021-05-28",
    "publishedOn": "2021-02-01",
    "personIds": [
      "r.lichtenberger"
    ]
  },
  {
    "name": "A Modern JavaFX Theme: JMetro | Pedro Duque Vieira @ JFX Days 2020",
    "tags": "",
    "type": "Library",
    "description": "JMetro is an open source theme for JavaFX. A JavaFX theme inspired by Microsoft Fluent Design. It is being used on production ready applications, some notable examples include the famous NASA’s Deep Space Trajectory Explorer application, NASA’s TODV, etc. Besides changing the appearance of controls, it also changes their behavior, with the addition of new functionality (through the skins API). All of this is done without the developer having to change anything in his code. This talk will focus on what is JMetro, how to use it and notable examples of applications using it.",
    "id": "p5YSB8mza94",
    "minutes" : "18",
    "event": "JFX Days 2020",
    "platform": "Desktop, Web, Mobile, Embedded",
    "createdOn": "2021-05-18",
    "modifiedOn": "2021-05-28",
    "publishedOn": "2021-02-01",
    "personIds": [
      "p.vieira"
    ]
  },
  {
    "name": "JavaFX real-world application: CoachFX | Dirk Lemmermann @ JFX Days 2020",
    "tags": "",
    "type": "Real World Application",
    "domain": "Sports",
    "description": "Coaching a sports team means far more than just standing on the sidelines of a pitch. Furthermore, coaches need to analyze different game situations and improve the team behavior based on these findings. Want to see how this works? Dirk Lemmermann talked about this during the JFX Days 2020 and presented the CoachFX application as a real-world customer project.",
    "id": "BdqHnb1qB3I",
    "minutes" : "14",
    "event": "JFX Days 2020",
    "platform": "Desktop",
    "createdOn": "2021-05-18",
    "modifiedOn": "2021-05-28",
    "publishedOn": "2021-01-25",
    "personIds": [
      "d.lemmermann"
    ]
  },
  {
    "name": "JavaFX real-world application: NEOS @ EBU | Dirk Lemmermann",
    "tags": "",
    "type": "Real World Application",
    "domain": "Scheduling",
    "description": "This video shows the NEOS application that is being used by the European Broadcasting Union to schedule resources for broadcasting TV and radio signals. The client was written in JavaFX 8. It communicates with the server via REST service calls.",
    "id": "RN_Pcu8ssQc",
    "minutes" : "2",
    "event": "",
    "platform": "Desktop",
    "createdOn": "2021-05-28",
    "modifiedOn": "2021-05-28",
    "publishedOn": "2016-01-04",
    "personIds": [
      "d.lemmermann"
    ]
  },
  {
    "name": "JavaFX real-world application: MINT TRMS Scheduling Demo | Dirk Lemmermann",
    "tags": "",
    "type": "Real World Application",
    "domain": "Scheduling",
    "description": "The video shows the scheduling part of the the MINT TRMS (Training and Resource Management) application in action. The software is used by airlines to ensure that their staff is always up-to-date regarding their certifications. MINT TRMS utilizes the FlexGanttFX framework.",
    "id": "d-oxGpUkFe4",
    "minutes" : "1",
    "event": "",
    "platform": "Desktop",
    "createdOn": "2021-05-28",
    "modifiedOn": "2021-05-28",
    "publishedOn": "2016-01-04"
  },
  {
    "name": "JavaFX real-world application: Deep Space Trajectory Explorer",
    "tags": "",
    "type": "Real World Application",
    "domain": "Research",
    "description": "The 100% JavaFX 8 tool allows a trajectory designer to identify, compare and export deep space 3 body system trajectories. The application treats the data itself as the interface allowing the user to interact, search and filter the data visually in multi-dimensional 2D and 3D views. Orbit regimes supported include any Planetary-Moon system, Lagrangian Halo Families and Small Body/Asteroid models.",
    "id": "MotQ1PC1xT8",
    "minutes" : "3",
    "event": "",
    "platform": "Desktop",
    "createdOn": "2021-05-28",
    "modifiedOn": "2021-05-28",
    "publishedOn": "2015-10-21"
  },
  {
    "name": "JavaFX real-world application: Monastery Disentis",
    "tags": "",
    "type": "Real World Application",
    "domain": "Tourism",
    "description": "A screencast of the JavaFX mobile app of the monastery Disentis. It is used as a guide for the visitors of the monastery.",
    "id": "67RonidGgEA",
    "minutes" : "1",
    "event": "",
    "platform": "Desktop",
    "createdOn": "2021-05-28",
    "modifiedOn": "2021-05-31",
    "publishedOn": "2017-05-08"
  },
  {
    "name": "JFX Days Zurich 2018: Extreme GUI Makeover | Hendrik Ebbers & Dirk Lemmermann",
    "tags": "",
    "type": "Presentation",
    "domain": "",
    "description": "A recording of Dirk Lemmermann's Hendrik Ebbers' presentation at the JFX Days Zurich 2018. They are showing how a boring application can be pimped to make it look more up-to-date and sexy. CSS Styling, animations, effects, media player integration, transformations, etc... all the good stuff. [JFXDays 2018](http://jfx-days.com)",
    "id": "-XY3Jjkz1sk",
    "minutes" : "39",
    "event": "JFX Days 2018",
    "personIds": [
      "d.lemmermann",
      "h.ebbers"
    ],
    "platform": "Desktop",
    "createdOn": "2021-06-07",
    "modifiedOn": "2021-06-07",
    "publishedOn": "2019-01-10"
  },
  {
    "name": "JFX Days Zurich 2018 Keynote | Dirk Lemmermann et al.",
    "tags": "",
    "type": "Presentation",
    "domain": "",
    "description": "This is a recording of the keynote of the JFX Days conference in Zurich (December 4th, 2018). The keynote consists of four parts. Introduction DLSC. DLSC Open Source Projects (PreferencesFX (7:20), WorkbenchFX (13:27)), Graviton Presentation (21:53), Show & Tell. The last part shows a total of ten applications that are using JavaFX: Sideline Sports Presentation Builder (31:56), NaviElektro Situational Awareness Applications (33:21), Carl Zeiss (37:40), Sophia AI Genetics (40:00), Rinkai Routing Optimization (42:49), Safran Batch Production (46:23), Woanna Team Collaboration (51:50), Michael Paus Aviation (56:00), Synedra (59:24), Rohm Semiconductors (1:03:02).",
    "id": "Lg6Hvj7_P14",
    "minutes" : "69",
    "event": "JFX Days 2018",
    "personIds": [
      "d.lemmermann"
    ],
    "platform": "Desktop",
    "createdOn": "2021-06-07",
    "modifiedOn": "2021-06-07",
    "publishedOn": "2018-12-13"
  },
  {
    "name": "JFX Days Zurich 2018: Custom Controls | Gerrit Grunwald",
    "tags": "",
    "type": "Presentation",
    "domain": "",
    "description": "A recording of Gerrit Grunwald's presentation on **Custom Controls** at the JFX Days Zurich 2018. You will see and learn how to develop truly professional controls for your apps.",
    "id": "OuF2BMnCjt4",
    "minutes" : "39",
    "event": "JFX Days 2018",
    "personIds": [
      "g.grunwald"
    ],
    "platform": "Desktop",
    "createdOn": "2021-06-07",
    "modifiedOn": "2021-06-07",
    "publishedOn": "2019-01-09"
  },
  {
    "name": "JFX Days Zurich 2018: Supercharge the JavaFX Canvas | David Gilbert",
    "tags": "",
    "type": "Presentation",
    "domain": "",
    "description": "Java charting legend David Gilbert presents FxGraphics2D, a wrapper around the Swing Graphics API.",
    "id": "iyxrcDThtIo",
    "minutes" : "34",
    "event": "JFX Days 2018",
    "personIds": [
      "d.gilbert"
    ],
    "platform": "Desktop",
    "createdOn": "2021-06-07",
    "modifiedOn": "2021-06-07",
    "publishedOn": "2019-01-01"
  },
  {
    "name": "JFX Days Zurich 2018: DRIFT Announcement | Tom Schindl",
    "tags": "",
    "type": "Presentation",
    "domain": "",
    "description": "Tom Schindle's announcement of DRIFT / OpenGL / D3D support for JavaFX.\n",
    "id": "3OSgPJghGhM",
    "minutes" : "7",
    "event": "JFX Days 2018",
    "personIds": [
      "t.schindl"
    ],
    "platform": "Desktop",
    "createdOn": "2021-06-07",
    "modifiedOn": "2021-06-07",
    "publishedOn": "2018-12-09"
  },
  {
    "name": "JFX Days Zurich 2018: JavaFX on Mobile & Embedded | Gluon",
    "tags": "",
    "type": "Presentation",
    "domain": "",
    "description": "This video is about JavaFX on mobile and embedded via Gluon.",
    "id": "H4wnGgDWZdE",
    "minutes" : "49",
    "event": "JFX Days 2018",
    "personIds": [
      "j.vos",
      "j.pereda"
    ],
    "platform": "Desktop",
    "createdOn": "2021-06-07",
    "modifiedOn": "2021-06-07",
    "publishedOn": "2019-03-27"
  },
  {
    "name": "JFX Days Zurich 2018: HTML in JavaFX | Anton Epple",
    "tags": "",
    "type": "Presentation",
    "domain": "",
    "description": "Listen to Anton Epple explaining how to use the combination of HTML and JavaFX.",
    "id": "B5CCv0TQoLM",
    "minutes" : "45",
    "event": "JFX Days 2018",
    "personIds": [
      "a.epple"
    ],
    "platform": "Desktop",
    "createdOn": "2021-06-07",
    "modifiedOn": "2021-06-07",
    "publishedOn": "2019-04-03"
  },
  {
    "name": "JFX Days Zurich 2018: e(fx)clipse | Tom Schindl",
    "tags": "",
    "type": "Presentation",
    "domain": "",
    "description": "Hear Tom Schindl present the e(fx)clipse project and all the various frameworks it provides to speed up your application development. This presentation also included the world premiere of DRIFT (OpenGL support for JavaFX).",
    "id": "9g4JrOJ6Clc",
    "minutes" : "44",
    "event": "JFX Days 2018",
    "personIds": [
      "t.schindl"
    ],
    "platform": "Desktop",
    "createdOn": "2021-06-07",
    "modifiedOn": "2021-06-07",
    "publishedOn": "2019-04-09"
  },
  {
    "name": "JFX Days 2019: NativeFX | Michael Hoffer",
    "tags": "",
    "type": "Presentation",
    "domain": "",
    "description": "Michael Hoffer presents his open source project NativeFX that takes advantage of JavaFX's capability of native rendering by third party apps (e.g. OpenGL apps). For more info [check out the project's repository on GitHub.](https://github.com/miho/NativeFX).",
    "id": "nbti6JC3ppU",
    "minutes" : "38",
    "event": "JFX Days 2019",
    "personIds": [
      "m.hoffer"
    ],
    "platform": "Desktop",
    "createdOn": "2021-06-07",
    "modifiedOn": "2021-06-07",
    "publishedOn": "2020-03-19"
  },
  {
    "name": "JFX Days 2019: Desktop 2019 | Hendrik Ebbers",
    "type": "Presentation",
    "tags": "",
    "domain": "",
    "description": "Some years ago development of Java Desktop applications was easy: We just downloaded Java 8 from Oracle and got a set of useful tools and framework to develop Java desktop applications:\n\nAWT & Swing\nWebStart\nJavaFX\nJFX Packager\n\nIf you now download a Java version from Oracle (or any other vendor) several of the mentioned tools and frameworks are gone. Some JDKs only contain AWT & Swing for desktop development and miss all the newer tools. But even if they include such tools or frameworks you have sometimes no idea about their state.\n\nIn this session I will give an overview about the differences between JDKs that you can use today and how frameworks like JavaFX are really supported by the vendors. Next to this we will have a look at all the tools that are important for building and installing desktop development.",
    "id": "biokgYUnvr4",
    "minutes" : "59",
    "event": "JFX Days 2019",
    "personIds": [
      "h.ebbers"
    ],
    "platform": "Desktop",
    "createdOn": "2021-06-07",
    "modifiedOn": "2021-06-07",
    "publishedOn": "2020-09-07"
  },
  {
    "name": "Oracle CodeOne: JavaFX Tips and Tricks: Reloaded | Dirk Lemmermann",
    "tags": "tips, tricks, designer, figma, adobe",
    "type": "Presentation",
    "domain": "",
    "description": "A tips & tricks session presented by Dirk Lemmermann at Oracle CodeOne in 2019",
    "id": "sJAjb_Dht_w",
    "minutes" : "46",
    "event": "Oracle CodeOne 2019",
    "personIds": [
      "d.lemmermann"
    ],
    "platform": "Desktop",
    "createdOn": "2021-06-07",
    "modifiedOn": "2021-06-07",
    "publishedOn": "2019-09-17"
  },
  {
    "name": "JavaFX Graphics Tips and Tricks | Richard Bair",
    "tags": "graphics, performance, tip, trick",
    "type": "Presentation",
    "domain": "",
    "description": "JavaFX provides a rich set of graphical shapes and attributes that gives application developers many ways to achieve a variety of interesting visual effects. Many of these will serve you well, but some come with a high performance cost. This session provides practical advice on writing efficient JavaFX applications, specifically to help application developers get the most performance out of their applications. It shows several examples of things you should do in your applications and things to avoid in areas such as image loading, transformations, animation, effects, and blending. It also shows you how to use profiling tools in your applications to help you understand the performance bottlenecks and identify the trouble spots.",
    "id": "ddJpDi5SWFc",
    "minutes" : "60",
    "event": "Oracle Learning",
    "personIds": [
    ],
    "platform": "Desktop",
    "createdOn": "2021-06-07",
    "modifiedOn": "2021-06-07",
    "publishedOn": "2013-01-30"
  },
  {
    "name": "Medusa Demo",
    "tags": "gauges, charts, graphs, instruments",
    "type": "Library",
    "domain": "",
    "description": "A short video highlighting the various gauges found inside the Medusa project.",
    "id": "l2ZYO4HXjLg",
    "minutes" : "1",
    "event": "",
    "personIds": [
      "g.grunwald"
    ],
    "platform": "Desktop",
    "createdOn": "2021-06-14",
    "modifiedOn": "2021-06-14",
    "publishedOn": "2013-06-14"
  },
  {
    "name": "JavaFX Ikonli Font Icon Packs Tutorial",
    "tags": "icon, material design, fontawesome, awesome, icon font, svg",
    "type": "Tutorial",
    "domain": "",
    "description": "How to use icon fonts in your JavaFX application.",
    "id": "o5UewXgUiYY",
    "minutes" : "9",
    "event": "",
    "platform": "Desktop",
    "createdOn": "2021-06-14",
    "modifiedOn": "2021-06-14",
    "publishedOn": "2013-06-14",
    "tipIds": [
      "ikonli"
    ]
  },
  {
    "name": "CSSFX Introduction",
    "tags": "css, reload, develop, debug",
    "type": "Tutorial",
    "domain": "",
    "description": "CSSFX is a tool for JavaFX developers allowing them to push CSS changes in a running JavaFX application. Modify your project CSS directly in your preferred IDE/editor and changes are directly visible.",
    "id": "RELKg32xEWU",
    "minutes" : "3",
    "event": "",
    "platform": "Desktop",
    "createdOn": "2021-06-16",
    "modifiedOn": "2021-06-16",
    "publishedOn": "2013-06-16",
    "personIds": [
      "m.brouillard"
    ]
  },
  {
    "name": "Introduction to JavaFX Scenic View",
    "tags": "tool, scene, graph, debug",
    "type": "Tutorial",
    "domain": "",
    "description": "Scenic View is a handy (and free!) tool for analysing a JavaFX scenegraph at runtime. Attend this session to learn more about this tool, and how to use it during the development of your own applications.",
    "id": "peYfsoViKa4",
    "minutes" : "19",
    "event": "Devoxx",
    "platform": "Desktop",
    "createdOn": "2021-06-16",
    "modifiedOn": "2021-06-16",
    "publishedOn": "2013-06-16"
  },
  {
    "name": "Testing JavaFX Applications with TestFX 4 (Part1)",
    "tags": "tutorial, testing",
    "type": "Tutorial",
    "domain": "",
    "description": "Introduces how to perform JavaFX interaction tests via TestFX 4. TestFX 4 is still in active development (alpha phase) however it has been for some time now. This is a good opportunity to start getting acquainted with it!\n\nThe demo builds on the \"NASA Missions Database\" project already covered in previous videos and therefore focuses on how to setup TestFX 4 in order to integrate with your JavaFX / Spring Boot application.\n\nOnce setup, I go through some basic functional tests which\nuse the TestFX API.This tutorial is ideal for getting up and started with TestFX 4.",
    "id": "NG03nNpSmgU",
    "minutes" : "17",
    "event": "",
    "platform": "",
    "createdOn": "2021-06-16",
    "modifiedOn": "2021-06-16",
    "publishedOn": "2013-06-16"
  },
  {
    "name": "Headless testing with JavaFX and TestFX (Part2)",
    "tags": "tutorial, testing",
    "type": "Tutorial",
    "domain": "",
    "description": "Shows you how to setup headless functional testing with TestFx 4 and Java FX 8 in a developer IDE (Netbeans 8.1).\n\nAre you tired of waiting around for your functional tests to complete as they take over your mouse and keyboard, thus slowing your progress? With headless testing in place you can let those functional tests run without being interrupted.\n\nThis quick tutorial shows you how to switch between headful and headless mode testing via the Netbeans IDE.\n\nHere are the System properties you will need to set (as shown in tutorial)...\n\n```\nSystem.setProperty(\"testfx.robot\", \"glass\");\nSystem.setProperty(\"testfx.headless\", \"true\");\nSystem.setProperty(\"prism.order\", \"sw\");\nSystem.setProperty(\"prism.text\", \"t2k\");\nSystem.setProperty(\"java.awt.headless\", \"true\");\n```",
    "id": "V7IHHZc9Bew",
    "minutes" : "5",
    "event": "",
    "platform": "",
    "createdOn": "2021-06-16",
    "modifiedOn": "2021-06-16",
    "publishedOn": "2013-06-16"
  },
  {
    "name": "FlexGanttFX - Emirates POC running on iPad",
    "tags": "ipad, ios, aviation, planning, scheduling, touch",
    "type": "Library",
    "domain": "Scheduling",
    "description": "This video shows the FlexGanttFX framework for JavaFX running on an iPad thanks to GraalVM and the Gluon client plugin. The code base is 100% identical, no matter if this runs on the desktop, on iOS, on Android, or in the Web (with JPro).",
    "id": "v4GkjST64Hk",
    "minutes" : "1",
    "event": "",
    "platform": "",
    "createdOn": "2021-06-16",
    "modifiedOn": "2021-06-16",
    "publishedOn": "2013-06-16",
    "personIds": [
      "d.lemmermann"
    ]
  },
  {
    "name": "FlexGanttFX - Canvas & Dateline Buffer",
    "tags": "canvas, clipping, tip, trick",
    "type": "Library",
    "domain": "Scheduling",
    "description": "This video shows how FlexGanttFX utilizes a buffer on both sides of each row's canvas and on both sides of the timeline in order to increase rendering performance. By also drawing into a buffer then Gantt chart needs to perform full redraws less often while the user is scrolling.\n\nPlease notice that the canvas offsets (translate-x) are random. This way a full redraw is not happening for all rows at the same time.",
    "id": "jzy4b5GxkRA",
    "minutes" : "1",
    "event": "",
    "platform": "",
    "createdOn": "2021-06-16",
    "modifiedOn": "2021-06-16",
    "publishedOn": "2013-06-16",
    "personIds": [
      "d.lemmermann"
    ]
  },
  {
    "name": "FlexGanttFX - European Broadcasting Union / NEOS",
    "tags": "planning, scheduling, tv, radio, broadcasting, transmission, resource",
    "type": "Real World Application",
    "domain": "Scheduling",
    "description": "This video shows the NEOS application that is being used by the European Broadcasting Union to schedule resources for broadcasting TV and radio signals. The client was written in JavaFX 8. It communicates with the server via REST service calls.",
    "id": "RN_Pcu8ssQc",
    "minutes" : "2",
    "event": "",
    "platform": "",
    "createdOn": "2021-06-16",
    "modifiedOn": "2021-06-16",
    "publishedOn": "2013-06-16",
    "personIds": [
      "d.lemmermann"
    ]
  },
  {
    "name": "FlexGanttFX - Emirates Airline",
    "tags": "planning, scheduling, aviation, resource",
    "type": "Real World Application",
    "domain": "Scheduling",
    "description": "Emirates Airline uses JavaFX in combination with FlexGanttFX for their \"Network Capacity Optimization\" software. It allows the user to insert new flights into the current flight schedule, modify existing flights, delete flights. Different scenarios can be created for each change request and the scenarios can be compared with each other and evaluated based on their impact on the existing schedule.",
    "id": "Qju5_JYR8nY",
    "minutes" : "2",
    "event": "",
    "platform": "",
    "createdOn": "2021-06-16",
    "modifiedOn": "2021-06-16",
    "publishedOn": "2013-06-16",
    "personIds": [
      "d.lemmermann"
    ]
  },
  {
    "name": "FlexGanttFX - MINT TRMS Scheduling Demo",
    "tags": "planning, scheduling, aviation, resource",
    "type": "Real World Application",
    "domain": "Scheduling",
    "description": "The video shows the scheduling part of the the MINT TRMS (Training and Resource Management) application in action. The software is used by airlines to ensure that their staff is always up-to-date regarding their certifications. MINT TRMS utilizes the FlexGanttFX framework for the interactive schedule",
    "id": "d-oxGpUkFe4",
    "minutes" : "1",
    "event": "",
    "platform": "",
    "createdOn": "2021-06-16",
    "modifiedOn": "2021-06-16",
    "publishedOn": "2013-06-16",
    "personIds": [
      "d.lemmermann"
    ]
  },
  {
    "name": "DesktopPaneFX Demonstration",
    "tags": "desktop, mdi, internal windows, jdesktoppane",
    "type": "Library",
    "domain": "",
    "description": "A demonstration of DesktopPaneFX, an MDI component for JavaFX.",
    "id": "gUPLJh05b3w",
    "minutes" : "1",
    "event": "",
    "platform": "",
    "createdOn": "2021-06-16",
    "modifiedOn": "2021-06-16",
    "publishedOn": "2013-06-16",
    "personIds": [
      "a.almiray"
    ]
  },
  {
    "name": "FXGL 11 Showcase Trailer",
    "tags": "game, gaming, engine",
    "type": "Library",
    "domain": "Gaming",
    "description": "A compilation of FXGL 11 games and demos, showcasing core engine features.",
    "id": "fuDQg7W0v4g",
    "minutes" : "3",
    "event": "",
    "platform": "",
    "createdOn": "2021-06-16",
    "modifiedOn": "2021-06-16",
    "publishedOn": "2013-06-16",
    "personIds": [
      "a.baimagambetov"
    ]
  },
  {
    "name": "PDFViewFX",
    "tags": "pdf, viewer",
    "type": "Library",
    "domain": "",
    "description": "A short demo video of the PDFView control found in the GemsFX project. The control utilises the Apache PDFBox project to render PDF files to a Java2D buffered image and from there converts it to a JavaFX Image object.",
    "id": "oyV9q720F9s",
    "minutes" : "1",
    "event": "",
    "platform": "",
    "createdOn": "2021-06-16",
    "modifiedOn": "2021-06-16",
    "publishedOn": "2013-06-16",
    "personIds": [
      "d.lemmermann"
    ]
  },
  {
    "name": "XPS - DrawFX",
    "tags": "clipping, drawing, animation, animate, shapes, timeline",
    "type": "Real World Application",
    "domain": "Sports",
    "description": "The video shows an add-on recently made for the \"presenter\" application of the XPS solution for sport teams / coaches. It enables the coach to create animations for a single frame of a video to visualize his observations and ideas. The last addition we recently made to this software is \"smart clipping\", which cuts out players so that the graphic objects (lines, polygons, etc....) will no longer be on top of the players but behind them. The solution delegates the work to a server. In this video we are still working with a slow test server. Performance will be better once the production server is in place.",
    "id": "OflZ745MYT0",
    "minutes" : "2",
    "event": "",
    "platform": "",
    "createdOn": "2021-06-16",
    "modifiedOn": "2021-06-16",
    "publishedOn": "2013-06-16",
    "personIds": [
      "d.lemmermann"
    ]
  },
  {
    "name": "KeyboardFX - On-Screen Keyboard",
    "tags": "keyboard, touch, on-screen, virtual, gesture, ipad",
    "type": "Library",
    "domain": "",
    "description": "This video shows an intermediate step while developing a custom on-screen keyboard for JavaFX. The keyboard can now slide in/out and show different layouts (keys) depending on the selected textfield (US, DE).",
    "id": "nZ01ffBOW7U",
    "minutes" : "1",
    "event": "",
    "platform": "",
    "createdOn": "2021-06-16",
    "modifiedOn": "2021-06-16",
    "publishedOn": "2013-06-16",
    "personIds": [
      "d.lemmermann"
    ]
  },
  {
    "name": "EIZO CuratOR - Comprehensive Solutions for the Integrated OR",
    "tags": "or, medical, surgery, video, recording",
    "type": "Real World Application",
    "domain": "Medical",
    "description": "CuratOR means powerful image reproduction and video management technology for visual OR solutions. Designed with scalability and expandability in mind, EIZO offers products and solutions specifically tailored to the requirements and workflow in the OR.",
    "id": "0Muf-yxuu7I",
    "minutes" : "2",
    "event": "",
    "platform": "",
    "createdOn": "2021-07-07",
    "modifiedOn": "2021-07-07",
    "publishedOn": "2013-07-07",
    "personIds": [
      "d.lemmermann"
    ]
  },
  {
    "name": "Sankeyplot Demo",
    "tags": "charts, scientific, video, recording",
    "type": "Library",
    "domain": "",
    "description": "Short demo video of the selection in the Charts library Sankey Plot",
    "id": "Csl0yIdqWB8",
    "minutes" : "1",
    "event": "",
    "platform": "",
    "createdOn": "2021-08-20",
    "modifiedOn": "2021-08-20",
    "publishedOn": "2013-08-20",
    "personIds": [
      "g.grunwald"
    ]
  },
  {
    "name": "Worldmap Chart connections Demo",
    "tags": "charts, scientific, video, recording",
    "type": "Library",
    "domain": "Charts",
    "description": "Short demo video showing animated connections on the Charts library Worldmap",
    "id": "C0YA8QA1K8k",
    "minutes" : "1",
    "event": "",
    "platform": "",
    "createdOn": "2021-08-20",
    "modifiedOn": "2021-08-20",
    "publishedOn": "2013-08-20",
    "personIds": [
      "g.grunwald"
    ]
  },
  {
    "name": "Parallel Coordinates Chart Demo",
    "tags": "charts, scientific, video, recording",
    "type": "Library",
    "domain": "",
    "description": "Short demo video showing the Parallel Coordinates Chart of the Charts library",
    "id": "qaQ2Dh_0pgU",
    "minutes" : "1",
    "event": "",
    "platform": "",
    "createdOn": "2021-08-20",
    "modifiedOn": "2021-08-20",
    "publishedOn": "2013-08-20",
    "personIds": [
      "g.grunwald"
    ]
  },
  {
    "name": "Comparison Ring Chart Demo",
    "tags": "charts, scientific, video, recording",
    "type": "Library",
    "domain": "",
    "description": "Short demo video showing the Comparison Ring Chart of the Charts library",
    "id": "gE1PJoLzMvk",
    "minutes" : "1",
    "event": "",
    "platform": "",
    "createdOn": "2021-08-20",
    "modifiedOn": "2021-08-20",
    "publishedOn": "2013-08-20",
    "personIds": [
      "g.grunwald"
    ]
  },
  {
    "name": "Concentric Ring Chart Demo",
    "tags": "charts, scientific, video, recording",
    "type": "Library",
    "domain": "",
    "description": "Short demo video showing the Concentric Ring Chart of the Charts library",
    "id": "SX5jGJFz2-M",
    "minutes" : "1",
    "event": "",
    "platform": "",
    "createdOn": "2021-08-20",
    "modifiedOn": "2021-08-20",
    "publishedOn": "2013-08-20",
    "personIds": [
      "g.grunwald"
    ]
  },
  {
    "name": "Matrix Heatmap Chart Demo",
    "tags": "charts, scientific, video, recording",
    "type": "Library",
    "domain": "",
    "description": "Short demo video showing the Matrix Heatmap Chart of the Charts library",
    "id": "UQGiRTNhvKU",
    "minutes" : "1",
    "event": "",
    "platform": "",
    "createdOn": "2021-08-20",
    "modifiedOn": "2021-08-20",
    "publishedOn": "2013-08-20",
    "personIds": [
      "g.grunwald"
    ]
  },
  {
    "name": "Smoothed Chart Demo",
    "tags": "charts, scientific, video, recording",
    "type": "Library",
    "domain": "Charts",
    "description": "Short demo video showing the Smoothed Chart of the Charts library",
    "id": "f-QsjigWQjc",
    "minutes" : "1",
    "event": "",
    "platform": "",
    "createdOn": "2021-08-20",
    "modifiedOn": "2021-08-20",
    "publishedOn": "2013-08-20",
    "personIds": [
      "g.grunwald"
    ]
  },
  {
    "name": "MaterialFX v11.6.0 Features Preview",
    "tags": "material, design, google, custom controls",
    "type": "Library",
    "domain": "",
    "description": "Walk-thru video of the MaterialFX demo application. Quick way to see all features / controls.",
    "id": "Pf--fVK6hs8",
    "minutes" : "3",
    "event": "",
    "platform": "",
    "createdOn": "2021-11-10",
    "modifiedOn": "2021-11-10",
    "publishedOn": "2021-02-03",
    "personIds": [
    ]
  },
  {
    "name": "QF-Test Overview | GUI Test Tool for Java, Web and Windows",
    "tags": "testing, test automation",
    "type": "Tool",
    "domain": "Test Automation",
    "description": "A brief overview of the GUI Test tool QF-Test which helps you easily create automated GUI tests for Java Swing, JavaFX, Eclipse / SWT / RCP, Web (AJAX, HTML, DOM) and Desktop Windows applications.",
    "id": "ifrUL9na1kU",
    "minutes" : "4",
    "createdOn": "2021-12-10",
    "modifiedOn": "2021-12-10",
    "publishedOn": "2018-04-23",
    "companyIds": [
      "qfs"
    ],
    "toolIds": [
      "qftest"
    ]
  },
  {
    "name": "Front and Center! JavaFX with Spring Boot",
    "tags": "spring boot springboot REST CRUD ignite",
    "type": "Tutorial",
    "domain": "",
    "description": "How to use JavaFX with Spring Boot",
    "id": "ypb07LA7hU4",
    "minutes" : "72",
    "event": "JChampions Conf",
    "createdOn": "2022-02-11",
    "modifiedOn": "2022-02-11",
    "publishedOn": "2022-01-25"
  },
  {
    "name": "Start a new JavaFX project in IntelliJ IDEA",
    "tags": "project setup, intellij",
    "type": "Tool",
    "domain": "",
    "description": "Creating a new JavaFX project has never been easier with the project wizard in Jetbrains IntelliJ IDEA. Creating a new project is just a matter of clicking a few buttons and you have your new user interface application up and running in a matter of minutes...!",
    "id": "v9rAR3waDJs",
    "minutes" : "3",
    "createdOn": "2022-02-04",
    "modifiedOn": "2022-02-04",
    "publishedOn": "2022-02-04",
    "personIds": [
      "f.delporte"
    ]
  },
  {
    "name": "TiwulFX Dock - Demo",
    "tags": "docking, custom controls",
    "type": "Library",
    "domain": "",
    "description": "A demonstration of TiwulFX Dock's tab-oriented docking capabilities.",
    "id": "YzVmCDTQv4M",
    "minutes" : "1",
    "createdOn": "2022-03-16",
    "modifiedOn": "2022-03-16",
    "publishedOn": "2022-03-16"
  },
  {
    "name": "SmartFinder Desktop Search - Sample search",
    "tags": "desktop search, search engine, windows search, spotlight",
    "type": "Real World Application",
    "domain": "Utilities",
    "description": "A demonstration of the SmartFinder search APP",
    "platform": "Desktop",
    "id": "vwb_L2hD3ds",
    "minutes" : "1",
    "createdOn": "2023-01-19",
    "modifiedOn": "2023-01-19",
    "publishedOn": "2023-01-19"
  },
  {
    "name": "StreamPi Guide: An Awesome Tool For OBS Users",
    "tags": "streaming, pi, stream-pi",
    "type": "Real World Application",
    "domain": "Streaming",
    "description": "Are you a streamer but don't have a fancy Elgato Stream Deck or Stream Deck Mini? Maybe you have a Raspberry Pi or an old Android gathering dust. Turn them into your own DIY stream deck with a sweet piece of open source software called Stream Pi.",
    "platform": "Desktop",
    "id": "jj5zoLIEn3s",
    "minutes" : "11",
    "createdOn": "2023-06-08",
    "modifiedOn": "2023-06-08",
    "publishedOn": "2020-05-13"
  },
  {
    "name": "Building My Own \"Stream Deck\" [Stream-Pi & Macro Deck]",
    "tags": "streaming, pi, stream-pi",
    "type": "Real World Application",
    "domain": "Streaming",
    "description": "I had... 'fun' trying to set up this stream deck alternative and thought you guys might enjoy it!",
    "platform": "Desktop",
    "id": "aXvqnh8ZKRs",
    "minutes" : "15",
    "createdOn": "2023-06-08",
    "modifiedOn": "2023-06-08",
    "publishedOn": "2023-03-11"
  },
  {
    "name": "JavaFX: PickerFX on iPhone via Gluon",
    "tags": "custom controls, mobile",
    "type": "Library",
    "domain": "",
    "description": "This video shows a small demo I wrote for showcasing the picker controls found in PickerFX. The demo uses Gluon and GraalVM to run on iOS.",
    "platform": "Desktop, Web, Mobile, Embedded",
    "id": "gbnVk6-tU4g",
    "minutes" : "1",
    "createdOn": "2023-09-06",
    "modifiedOn": "2023-09-06",
    "publishedOn": "2019-09-23"
  },
  {
    "name": "Webswing Promo",
    "tags": "webswing, swing, javafx, applet, netbeans, web, browser, migration",
    "type": "Tool",
    "platform": "Web",
    "description": "It's time to bring your Java application to the web. Find out more about Webswing in this short cartoon.",
    "id": "IpYlyCRZcxc",
    "minutes" : "2",
    "createdOn": "2023-11-24",
    "modifiedOn": "2023-11-24",
    "publishedOn": "2018-03-21",
    "personIds": [
      "v.meszaros"
    ]
  },
  {
    "name": "Webswing Migration Promo",
    "tags": "webswing, swing, javafx, applet, netbeans, web, browser, migration",
    "type": "Tool",
    "platform": "Web",
    "description": "Have you ever thought about what you are going to do with your legacy Java application? Old desktop applications will inevitably hit the definitive end of their lifecycle soon.",
    "id": "rBHBlICJMcU",
    "minutes" : "2",
    "createdOn": "2023-11-24",
    "modifiedOn": "2023-11-24",
    "publishedOn": "2020-08-11",
    "personIds": [
      "v.meszaros"
    ]
  },
  {
    "name": "SCell Integration for Optimized Justice Document Handling in Germany",
    "tags": "javafx, spreadsheet, office, integration, embedded",
    "type": "component",
    "platform": "desktop",
    "description": "Unveil SCell's integration in bk.text for the German justice system, enhancing document creation, editing, and storage. Enjoy seamless background operations, a compact editing window, quick XLSX file access, and a standalone version for comprehensive editing, making bk.text more robust and user-friendly.",
    "id": "Df0Jo0sq_lQ",
    "minutes" : "2",
    "createdOn": "2023-10-27",
    "modifiedOn": "2023-10-27",
    "publishedOn": "2024-07-14",
    "personIds": [
      "v.smeltsov"
    ]
  },
  {
    "name": "JFX In Action with Pedro Duque Vieira, aka Duke about Hero, PDFSam, FXThemes, FXComponents,...",
    "tags": "JFXInAction, javafx, application, library",
    "type": "JFX In Action",
    "platform": "Desktop",
    "domain": "Libraries, CAD, PDF",
    "description": "Interview with Pedro Duque Vieira, developer of beautiful, graphical applications and libraries that users feel happy to use and that significantly boost their productivity.",
    "id": "YaF62a4pebg",
    "minutes" : "18",
    "createdOn": "2024-06-06",
    "modifiedOn": "2024-06-06",
    "publishedOn": "2024-06-06",
    "personIds": [
      "p.vieira",
      "f.delporte"
    ],
    "companyIds": [
      "pixelduke.company"
    ],
    "libraryIds": [
      "fxthemes",
      "fxcomponents",
      "jmetro",
      "transit"
    ],
    "realworldIds": [
      "hero",
      "pdfsam"
    ]
  },
  {
    "name": "JFX In Action with Daniel Zimmermann about JavaFX and Kotlin",
    "tags": "JFXInAction, javafx, application, library",
    "type": "JFX In Action",
    "platform": "Desktop",
    "domain": "Infrastructure",
    "description": "Interview with Daniel Zimmermann, who combines JavaFX with Kotlin to build network testing applications.",
    "id": "OKbeVaHV3HA",
    "minutes" : "20",
    "createdOn": "2024-06-12",
    "modifiedOn": "2024-06-12",
    "publishedOn": "2024-06-12",
    "personIds": [
      "f.delporte"
    ]
  },
  {
    "name": "JFX In Action with Christopher Schnick about XPipe, an app to manage all your servers",
    "tags": "JFXInAction, javafx, application, library",
    "type": "JFX In Action",
    "platform": "Desktop",
    "domain": "Infrastructure",
    "description": "Interview with Christopher Schnick about XPipe. Christopher is a software engineer with experience in the Java ecosystem and desktop application development. He is passionate about designing innovative solutions for end users and learning new technologies and tools when needed. XPipe brings your entire server infrastructure at your fingertips. It helps you to manage all your servers from your local desktop without any remote setup.",
    "id": "mZV1OJ23d2c",
    "minutes" : "24",
    "createdOn": "2024-06-18",
    "modifiedOn": "2024-06-18",
    "publishedOn": "2024-06-18",
    "personIds": [
      "f.delporte"
    ],
    "libraryIds": [
      "atlantafx"
    ],
    "realworldIds": [
      "xpipe"
    ]
  },
  {
    "name": "JFX In Action with Robert Ladstätter about LogoRRR, a cross-platform log analysis tool",
    "tags": "JFXInAction, javafx, application, library, Scala",
    "type": "JFX In Action",
    "platform": "Desktop",
    "domain": "Infrastructure",
    "description": "Interview with Robert Ladstätter about LogoRRR. Robert is Team Lead at NEXTSENSE Worldwide and develops software with Scala and JavaFX. LogoRRR is a cross-platform log analysis tool, written in Scala and JavaFX, that offers a clear and rapid way to navigate through large text files, emphasizing critical events with its interactive, user-friendly interface.",
    "id": "2y8aK_t--gM",
    "minutes" : "18",
    "createdOn": "2024-06-26",
    "modifiedOn": "2024-06-26",
    "publishedOn": "2024-06-26",
    "personIds": [
      "f.delporte"
    ],
    "toolIds": [
      "testfx"
    ],
    "downloadIds": [
      "logorrr"
    ]
  }
]
